import { Monitor } from 'lucide-react';

import { GoogleAdsIcon } from '@/components/ui/icons/GoogleAdsIcon';
import { MetaIcon } from '@/components/ui/icons/MetaIcon';
import type { ServicesListItemType } from '@/types/general';

export const servicesList: ServicesListItemType[] = [
  {
    label_ua: 'Таргетована реклама (Meta Ads)',
    desc: [
      'Залучення гарячих заявок та платоспроможних клієнтів із Facebook & Instagram',
      'Проектування та запуск окупних рекламних воронок під ключ',
      'Безперервне А/B тестування креативів для зниження вартості ліда',
      'Безпечне масштабування кампаній без зливу бюджету та стрибків ціни',
    ],
    icon: MetaIcon,
  },
  {
    label_ua: 'Реклама в Google Ads та на Картах',
    desc: [
      'Перехоплення гарячого попиту користувачів, які вже шукають ваш продукт',
      'Налаштування ефективної пошукової реклами (PPC) та банерної мережі',
      'Виведення локального бізнесу в топ видачі Google Maps',
      'Оптимізація вартості кліка та підвищення CTR рекламних оголошень',
    ],
    icon: GoogleAdsIcon,
  },
  {
    label_ua: 'Створення сайтів під ключ',
    desc: [
      'Розробка сучасних багатосторінкових сайтів, лендінгів та інтернет-магазинів',
      'Ретельна технічна підготовка та оптимізація сторінок під запуск трафіку',
      'Висока швидкість завантаження та адаптивність під мобільні пристрої',
      'Продуманий UX/UI дизайн, заточений на максимальну конверсію у заявку',
    ],
    icon: Monitor,
  },
];
